In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
data=pd.read_csv('/home/anaswara/Desktop/DSA ACTIVITIES/Assignment/StudentsPerformance.csv')
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [3]:
StudentsPerformance=pd.DataFrame(data)
StudentsPerformance

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

# 1. Find out how many males and females participated in the test.

In [4]:
data[['gender']].value_counts()

gender
female    518
male      482
dtype: int64

There were 518 female participants and 482 male participants in the test.

# 2. What do you think about the students' parental level of education?

In [5]:
parental_education=data['parental level of education'].value_counts()
parental_education

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

Most of the parents went to some college and also some took associate's degree. Very few parents took master's degree, that is 59 parents completed master's degree.

# 3. Who scores the most on average for math, reading and writing based on

# ● Gender

In [6]:
avg=data.groupby('gender')['math score','reading score','writing score'].mean()
avg

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [7]:
maxClm_gender = avg[['math score','reading score','writing score']].max()
maxClm_gender

math score       68.821577
reading score    72.590734
writing score    72.467181
dtype: float64

In [8]:
maxValueIndex = avg.idxmax()
maxValueIndex

math score         male
reading score    female
writing score    female
dtype: object

For math scores, average of male participants are higher and in reading scores and writing scores, average of female participants are higher.

# ● Test preparation course

In [9]:
avg_prep=data.groupby('test preparation course')['math score','reading score','writing score'].mean()
avg_prep

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [10]:
maxClm_prep = avg_prep[['math score','reading score','writing score']].max()
maxClm_prep

math score       69.966480
reading score    74.175978
writing score    74.684358
dtype: float64

In [11]:
maxValueIndexGd = avg_prep.idxmax()
maxValueIndexGd

math score       completed
reading score    completed
writing score    completed
dtype: object

For math scores,reading scores and writing scores, average of test preparation course completed students was higher.

# 4. What do you think about the scoring variation for math, reading and writing based on

# ● Gender

In [12]:
variation1=data.groupby('gender')['math score','reading score','writing score'].var()
variation1

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [13]:
maxValueIndexGd = variation1.idxmax()
maxValueIndexGd

math score       female
reading score    female
writing score    female
dtype: object

In scoring variation evaluation on the basis of gender, female participants has scored higher than male participants.

# ● Test preparation course

In [14]:
variation2=data.groupby('test preparation course')['math score','reading score','writing score'].var()
variation2

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

In [15]:
variation2.idxmax()

math score       none
reading score    none
writing score    none
dtype: object

Here those who didn't participated in any test preparation course had the highest in scoring variation evaluation. Those students who completed test preparation course wasn't able to gain higher scoring variation than those non participants.

# 5. The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.

In [16]:
print("Before sorting:  \n")
print(StudentsPerformance)

Before sorting:

     gender race/ethnicity parental level of education         lunch  \
0    female        group C            some high school  free/reduced
1    female        group B                 high school  free/reduced
2    female        group B            some high school  free/reduced
3    female        group B                some college      standard
4    female        group C                some college  free/reduced
..      ...            ...                         ...           ...
995    male        group E                some college      standard
996    male        group A                some college      standard
997    male        group D                some college      standard
998    male        group E          associate's degree  free/reduced
999    male        group E           bachelor's degree      standard

    test preparation course  math score  reading score  writing score
0                      none           0             17             10
1                      none           8             24             23
2                      none          18             32             28
3                      none          11             38             32
4                      none          22             39             33
..                      ...         ...            ...            ...
995               completed          99             87             81
996               completed         100             96             86
997               completed         100             97             99
998               completed         100            100             93
999               completed         100            100            100

[1000 rows x 8 columns]

In [17]:
# sort data frame
StudentsPerformance.sort_values(["math score"], 
                    axis=0,
                    ascending=[False], 
                    inplace=True)
  
# displaying sorted data frame
print("\nAfter sorting:")
print(StudentsPerformance)

After sorting:
     gender race/ethnicity parental level of education         lunch  \
999    male        group E           bachelor's degree      standard
996    male        group A                some college      standard
515  female        group E                some college      standard
517  female        group E          associate's degree      standard
516  female        group E           bachelor's degree      standard
..      ...            ...                         ...           ...
2    female        group B            some high school  free/reduced
51   female        group C            some high school  free/reduced
3    female        group B                some college      standard
1    female        group B                 high school  free/reduced
0    female        group C            some high school  free/reduced

    test preparation course  math score  reading score  writing score
999               completed         100            100            100
996               completed         100             96             86
515                    none         100             92             97
517                    none         100            100            100
516                    none         100            100            100
..                      ...         ...            ...            ...
2                      none          18             32             28
51                     none          13             41             51
3                      none          11             38             32
1                      none           8             24             23
0                      none           0             17             10

[1000 rows x 8 columns]

In [18]:
#No. of students which means the 25% of total students(1000)
len(StudentsPerformance)*0.25

250.0

In [19]:
StudentsPerformance.head(250)
#Top 25% of students in maths score

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
...,...,...,...,...,...,...,...,...
856,male,group E,some high school,standard,completed,77,76,77
855,male,group E,associate's degree,free/reduced,completed,77,69,68
854,male,group D,some high school,standard,completed,77,68,69
853,male,group D,associate's degree,free/reduced,none,77,78,73
852,male,group D,some college,free/reduced,none,77,62,64

These are the 25% of students who are eligible for the bonus points offering by the management.